---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.InCanvasControlData
source: html/6f3210a6-153b-b437-e88e-4dbffec9db6e.htm
---
# InCanvasControlData Members

Constructs an InCanvasControlData with specific values assigned.